#### ExternalResourceLoadContext Members

---

|  |
| --- |
| ExternalResourceLoadContext Class   Methods   Properties   See Also |

The  ExternalResourceLoadContext  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | CallingDocumentHasModelPath | Indicates whether the document requesting the external resource has a defined ModelPath. |
| Public method | Dispose | Releases all resources used by the  ExternalResourceLoadContext |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetCallingDocumentModelPath | Returns a copy of the ModelPath of the document that is requesting the external resource. |
| Public method | GetCurrentlyLoadedReference | Returns a copy of the ExternalResourceReference currently in use by the containing element. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | LoadOperationType | An enum value indicating whether the resource load was triggered by an automatic event (such as file open) or an explicit user action. |

# See Also

ExternalResourceLoadContext Class

Autodesk.Revit.DB Namespace